Ran Plan for dir: `terraform/vault` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # random_password.chartmuseum_password will be created
+ resource "random_password" "chartmuseum_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 22
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # vault_auth_backend.k8s will be created
+ resource "vault_auth_backend" "k8s" {
      + accessor        = (known after apply)
      + disable_remount = false
      + id              = (known after apply)
      + path            = "kubernetes/kubefirst"
      + tune            = (known after apply)
      + type            = "kubernetes"
    }

  # vault_auth_backend.userpass will be created
+ resource "vault_auth_backend" "userpass" {
      + accessor        = (known after apply)
      + disable_remount = false
      + id              = (known after apply)
      + path            = "userpass"
      + tune            = (known after apply)
      + type            = "userpass"
    }

  # vault_generic_secret.atlantis_ngrok_secrets will be created
+ resource "vault_generic_secret" "atlantis_ngrok_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/atlantis-ngrok"
    }

  # vault_generic_secret.atlantis_secrets will be created
+ resource "vault_generic_secret" "atlantis_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/atlantis"
    }

  # vault_generic_secret.chartmuseum_secrets will be created
+ resource "vault_generic_secret" "chartmuseum_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/chartmuseum"
    }

  # vault_generic_secret.ci_secrets will be created
+ resource "vault_generic_secret" "ci_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/ci-secrets"
    }

  # vault_generic_secret.development_metaphor will be created
+ resource "vault_generic_secret" "development_metaphor" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/development/metaphor"
    }

  # vault_generic_secret.docker_config will be created
+ resource "vault_generic_secret" "docker_config" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/dockerconfigjson"
    }

  # vault_generic_secret.external_secrets_token will be created
+ resource "vault_generic_secret" "external_secrets_token" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/external-secrets-store"
    }

  # vault_generic_secret.minio_creds will be created
+ resource "vault_generic_secret" "minio_creds" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/minio"
    }

  # vault_generic_secret.production_metaphor will be created
+ resource "vault_generic_secret" "production_metaphor" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/production/metaphor"
    }

  # vault_generic_secret.regsitry_auth will be created
+ resource "vault_generic_secret" "regsitry_auth" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/registry-auth"
    }

  # vault_generic_secret.staging_metaphor will be created
+ resource "vault_generic_secret" "staging_metaphor" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/staging/metaphor"
    }

  # vault_identity_group.admins will be created
+ resource "vault_identity_group" "admins" {
      + external_member_entity_ids = false
      + external_member_group_ids  = false
      + external_policies          = false
      + id                         = (known after apply)
      + metadata                   = {
          + "version" = "2"
        }
      + name                       = "admins"
      + policies                   = [
          + "admin",
        ]
      + type                       = "internal"
    }

  # vault_identity_group.developers will be created
+ resource "vault_identity_group" "developers" {
      + external_member_entity_ids = false
      + external_member_group_ids  = false
      + external_policies          = false
      + id                         = (known after apply)
      + metadata                   = {
          + "version" = "2"
        }
      + name                       = "developers"
      + policies                   = [
          + "developer",
        ]
      + type                       = "internal"
    }

  # vault_identity_oidc_key.key will be created
+ resource "vault_identity_oidc_key" "key" {
      + algorithm          = "RS256"
      + allowed_client_ids = [
          + "*",
        ]
      + id                 = (known after apply)
      + name               = "kubefirst"
      + rotation_period    = 86400
      + verification_ttl   = 2500
    }

  # vault_identity_oidc_provider.kubefirst will be created
+ resource "vault_identity_oidc_provider" "kubefirst" {
      + allowed_client_ids = [
          + "*",
        ]
      + https_enabled      = true
      + id                 = (known after apply)
      + issuer             = (known after apply)
      + issuer_host        = "vault.kubefirst.dev"
      + name               = "kubefirst"
      + scopes_supported   = [
          + "email",
          + "groups",
          + "profile",
          + "user",
        ]
    }

  # vault_identity_oidc_scope.email_scope will be created
+ resource "vault_identity_oidc_scope" "email_scope" {
      + description = "Email scope."
      + id          = (known after apply)
      + name        = "email"
      + template    = <<-EOT
            {
              "email": {{identity.entity.metadata.email}}
            }
        EOT
    }

  # vault_identity_oidc_scope.group_scope will be created
+ resource "vault_identity_oidc_scope" "group_scope" {
      + description = "Groups scope."
      + id          = (known after apply)
      + name        = "groups"
      + template    = <<-EOT
            {
              "groups": {{identity.entity.groups.names}}
            }
        EOT
    }

  # vault_identity_oidc_scope.profile_scope will be created
+ resource "vault_identity_oidc_scope" "profile_scope" {
      + description = "Profile scope."
      + id          = (known after apply)
      + name        = "profile"
      + template    = <<-EOT
            {
              "profile": {{identity.entity.metadata.email}}
            }
        EOT
    }

  # vault_identity_oidc_scope.user_scope will be created
+ resource "vault_identity_oidc_scope" "user_scope" {
      + description = "User scope."
      + id          = (known after apply)
      + name        = "user"
      + template    = (known after apply)
    }

  # vault_kubernetes_auth_backend_config.k8s will be created
+ resource "vault_kubernetes_auth_backend_config" "k8s" {
      + backend                = "kubernetes/kubefirst"
      + disable_iss_validation = (known after apply)
      + disable_local_ca_jwt   = (known after apply)
      + id                     = (known after apply)
      + kubernetes_ca_cert     = (known after apply)
      + kubernetes_host        = "https://10.43.0.1"
    }

  # vault_kubernetes_auth_backend_role.k8s_atlantis will be created
+ resource "vault_kubernetes_auth_backend_role" "k8s_atlantis" {
      + alias_name_source                = (known after apply)
      + backend                          = "kubernetes/kubefirst"
      + bound_service_account_names      = [
          + "atlantis",
        ]
      + bound_service_account_namespaces = [
          + "*",
        ]
      + id                               = (known after apply)
      + role_name                        = "atlantis"
      + token_policies                   = [
          + "admin",
          + "default",
        ]
      + token_ttl                        = 86400
      + token_type                       = "default"
    }

  # vault_kubernetes_auth_backend_role.k8s_external_secrets will be created
+ resource "vault_kubernetes_auth_backend_role" "k8s_external_secrets" {
      + alias_name_source                = (known after apply)
      + backend                          = "kubernetes/kubefirst"
      + bound_service_account_names      = [
          + "external-secrets",
        ]
      + bound_service_account_namespaces = [
          + "*",
        ]
      + id                               = (known after apply)
      + role_name                        = "external-secrets"
      + token_policies                   = [
          + "admin",
          + "default",
        ]
      + token_ttl                        = 86400
      + token_type                       = "default"
    }

  # vault_mount.secret will be created
+ resource "vault_mount" "secret" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + description                  = "the default vault kv v2 backend"
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "secret"
      + seal_wrap                    = (known after apply)
      + type                         = "kv-v2"
    }

  # vault_mount.users will be created
+ resource "vault_mount" "users" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + description                  = "kv v2 backend"
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "users"
      + seal_wrap                    = (known after apply)
      + type                         = "kv-v2"
    }

  # vault_policy.admin will be created
+ resource "vault_policy" "admin" {
      + id     = (known after apply)
      + name   = "admin"
      + policy = <<-EOT
            
            # Create and manage entities and groups
            path "identity/*" {
              capabilities = [ "create", "read", "update", "delete", "list" ]
            }
            
            # Configure the OIDC auth method
            path "auth/*" {
              capabilities = [ "create", "read", "update", "delete", "list" ]
            }
            
            # Write ACL policies
            path "sys/policies/acl/*" {
              capabilities = [ "create", "read", "update", "delete", "list" ]
            }
            
            # Allow default access to secret
            path "secret/*" {
                capabilities = ["create", "read", "update", "delete", "list"]
            }
            
            path "aws/*" {
                capabilities = ["create", "read", "update", "delete", "list"]
            }
            
            # Allow default access to secret
            path "avp/*" {
                capabilities = ["create", "read", "update", "delete", "list"]
            }
            
            path "sys/mounts/*" {
              capabilities = [ "create", "read", "update", "delete", "list" ]
            }
            
            # List enabled secrets engine
            path "sys/mounts" {
              capabilities = [ "read", "list" ]
            }
              
            # allow admins to manage auth methods
            path "/sys/auth*" {
                capabilities = ["create", "read", "update", "delete", "list", "sudo"]
            }
            
            # allow admins to manage auth methods
            path "sys/auth/*" {
              capabilities = [ "create", "read", "update", "delete", "list" ]
            }
            
            # Allow tokens to look up their own properties
            path "auth/token/lookup-self" {
                capabilities = ["read"]
            }
            
            # Allow tokens to renew themselves
            path "auth/token/renew-self" {
                capabilities = ["update"]
            }
            
            # Allow tokens to revoke themselves
            path "auth/token/revoke-self" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up its own capabilities on a path
            path "sys/capabilities-self" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up its own entity by id or name
            path "identity/entity/id/{{identity.entity.id}}" {
              capabilities = ["read"]
            }
            path "identity/entity/name/{{identity.entity.name}}" {
              capabilities = ["read"]
            }
            
            # Allow a token to look up its resultant ACL from all policies. This is useful
            # for UIs. It is an internal path because the format may change at any time
            # based on how the internal ACL features and capabilities change.
            path "sys/internal/ui/resultant-acl" {
                capabilities = ["read"]
            }
            
            # Allow a token to renew a lease via lease_id in the request body; old path for
            # old clients, new path for newer
            path "sys/renew" {
                capabilities = ["update"]
            }
            path "sys/leases/renew" {
                capabilities = ["update"]
            }
            
            # Allow looking up lease properties. This requires knowing the lease ID ahead
            # of time and does not divulge any sensitive information.
            path "sys/leases/lookup" {
                capabilities = ["update"]
            }
            
            # Allow a token to manage its own cubbyhole
            path "cubbyhole/*" {
                capabilities = ["create", "read", "update", "delete", "list"]
            }
            
            # Allow a token to wrap arbitrary values in a response-wrapping token
            path "sys/wrapping/wrap" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up the creation time and TTL of a given
            # response-wrapping token
            path "sys/wrapping/lookup" {
                capabilities = ["update"]
            }
            
            # Allow a token to unwrap a response-wrapping token. This is a convenience to
            # avoid client token swapping since this is also part of the response wrapping
            # policy.
            path "sys/wrapping/unwrap" {
                capabilities = ["update"]
            }
            
            # Allow general purpose tools
            path "sys/tools/hash" {
                capabilities = ["update"]
            }
            path "sys/tools/hash/*" {
                capabilities = ["update"]
            }
            
            # Allow checking the status of a Control Group request if the user has the
            # accessor
            path "sys/control-group/request" {
                capabilities = ["update"]
            }
        EOT
    }

  # vault_policy.developer will be created
+ resource "vault_policy" "developer" {
      + id     = (known after apply)
      + name   = "developer"
      + policy = <<-EOT
            # Allow full write access to developers, without delete
            # Obviously it's your vault now, feel free to change the rules
            path "secret/*" {
                capabilities = ["create", "read", "update", "list"]
            }
            
            path "aws/creds/KubernetesDeveloper" {
                capabilities = ["read"]
            }
            
            # List available secrets engines to retrieve accessor ID
            path "sys/mounts" {
              capabilities = [ "read" ]
            }
            
            # Allow tokens to look up their own properties
            path "auth/token/lookup-self" {
                capabilities = ["read"]
            }
            
            # Allow tokens to renew themselves
            path "auth/token/renew-self" {
                capabilities = ["update"]
            }
            
            # Allow tokens to revoke themselves
            path "auth/token/revoke-self" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up its own capabilities on a path
            path "sys/capabilities-self" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up its own entity by id or name
            path "identity/entity/id/{{identity.entity.id}}" {
              capabilities = ["read"]
            }
            path "identity/entity/name/{{identity.entity.name}}" {
              capabilities = ["read"]
            }
            
            
            # Allow a token to look up its resultant ACL from all policies. This is useful
            # for UIs. It is an internal path because the format may change at any time
            # based on how the internal ACL features and capabilities change.
            path "sys/internal/ui/resultant-acl" {
                capabilities = ["read"]
            }
            
            # Allow a token to renew a lease via lease_id in the request body; old path for
            # old clients, new path for newer
            path "sys/renew" {
                capabilities = ["update"]
            }
            path "sys/leases/renew" {
                capabilities = ["update"]
            }
            
            # Allow looking up lease properties. This requires knowing the lease ID ahead
            # of time and does not divulge any sensitive information.
            path "sys/leases/lookup" {
                capabilities = ["update"]
            }
            
            # Allow a token to manage its own cubbyhole
            path "cubbyhole/*" {
                capabilities = ["create", "read", "update", "delete", "list"]
            }
            
            # Allow a token to wrap arbitrary values in a response-wrapping token
            path "sys/wrapping/wrap" {
                capabilities = ["update"]
            }
            
            # Allow a token to look up the creation time and TTL of a given
            # response-wrapping token
            path "sys/wrapping/lookup" {
                capabilities = ["update"]
            }
            
            # Allow a token to unwrap a response-wrapping token. This is a convenience to
            # avoid client token swapping since this is also part of the response wrapping
            # policy.
            path "sys/wrapping/unwrap" {
                capabilities = ["update"]
            }
            
            # Allow general purpose tools
            path "sys/tools/hash" {
                capabilities = ["update"]
            }
            path "sys/tools/hash/*" {
                capabilities = ["update"]
            }
            
            # Allow checking the status of a Control Group request if the user has the
            # accessor
            path "sys/control-group/request" {
                capabilities = ["update"]
            }
        EOT
    }

  # module.argo.data.vault_identity_group.admins will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "admins" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "admins"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.argo.data.vault_identity_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "developers" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "developers"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.argo.data.vault_identity_oidc_client_creds.creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_oidc_client_creds" "creds" {
      + client_id     = (known after apply)
      + client_secret = (sensitive value)
      + id            = (known after apply)
      + name          = "argo"
    }

  # module.argo.vault_generic_secret.creds will be created
+ resource "vault_generic_secret" "creds" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/oidc/argo"
    }

  # module.argo.vault_identity_oidc_assignment.app will be created
+ resource "vault_identity_oidc_assignment" "app" {
      + group_ids = (known after apply)
      + id        = (known after apply)
      + name      = "argo"
    }

  # module.argo.vault_identity_oidc_client.app will be created
+ resource "vault_identity_oidc_client" "app" {
      + access_token_ttl = 7200
      + assignments      = [
          + "argo",
        ]
      + client_id        = (known after apply)
      + client_secret    = (sensitive value)
      + client_type      = "confidential"
      + id               = (known after apply)
      + id_token_ttl     = 2400
      + key              = "kubefirst"
      + name             = "argo"
      + redirect_uris    = [
          + "https://argo.kubefirst.dev/oauth2/callback",
        ]
    }

  # module.argocd.data.vault_identity_group.admins will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "admins" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "admins"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.argocd.data.vault_identity_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "developers" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "developers"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.argocd.data.vault_identity_oidc_client_creds.creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_oidc_client_creds" "creds" {
      + client_id     = (known after apply)
      + client_secret = (sensitive value)
      + id            = (known after apply)
      + name          = "argocd"
    }

  # module.argocd.vault_generic_secret.creds will be created
+ resource "vault_generic_secret" "creds" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/oidc/argocd"
    }

  # module.argocd.vault_identity_oidc_assignment.app will be created
+ resource "vault_identity_oidc_assignment" "app" {
      + group_ids = (known after apply)
      + id        = (known after apply)
      + name      = "argocd"
    }

  # module.argocd.vault_identity_oidc_client.app will be created
+ resource "vault_identity_oidc_client" "app" {
      + access_token_ttl = 7200
      + assignments      = [
          + "argocd",
        ]
      + client_id        = (known after apply)
      + client_secret    = (sensitive value)
      + client_type      = "confidential"
      + id               = (known after apply)
      + id_token_ttl     = 2400
      + key              = "kubefirst"
      + name             = "argocd"
      + redirect_uris    = [
          + "https://argocd.kubefirst.dev/auth/callback",
        ]
    }

  # module.console.data.vault_identity_group.admins will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "admins" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "admins"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.console.data.vault_identity_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "developers" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "developers"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.console.data.vault_identity_oidc_client_creds.creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_oidc_client_creds" "creds" {
      + client_id     = (known after apply)
      + client_secret = (sensitive value)
      + id            = (known after apply)
      + name          = "console"
    }

  # module.console.vault_generic_secret.creds will be created
+ resource "vault_generic_secret" "creds" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/oidc/console"
    }

  # module.console.vault_identity_oidc_assignment.app will be created
+ resource "vault_identity_oidc_assignment" "app" {
      + group_ids = (known after apply)
      + id        = (known after apply)
      + name      = "console"
    }

  # module.console.vault_identity_oidc_client.app will be created
+ resource "vault_identity_oidc_client" "app" {
      + access_token_ttl = 7200
      + assignments      = [
          + "console",
        ]
      + client_id        = (known after apply)
      + client_secret    = (sensitive value)
      + client_type      = "confidential"
      + id               = (known after apply)
      + id_token_ttl     = 2400
      + key              = "kubefirst"
      + name             = "console"
      + redirect_uris    = [
          + "https://vouch.kubefirst.dev/auth",
        ]
    }

  # module.gitlab.data.vault_identity_group.admins will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "admins" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "admins"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.gitlab.data.vault_identity_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_group" "developers" {
      + alias_canonical_id              = (known after apply)
      + alias_creation_time             = (known after apply)
      + alias_id                        = (known after apply)
      + alias_last_update_time          = (known after apply)
      + alias_merged_from_canonical_ids = (known after apply)
      + alias_metadata                  = (known after apply)
      + alias_mount_accessor            = (known after apply)
      + alias_mount_path                = (known after apply)
      + alias_mount_type                = (known after apply)
      + alias_name                      = (known after apply)
      + creation_time                   = (known after apply)
      + data_json                       = (known after apply)
      + group_id                        = (known after apply)
      + group_name                      = "developers"
      + id                              = (known after apply)
      + last_update_time                = (known after apply)
      + member_entity_ids               = (known after apply)
      + member_group_ids                = (known after apply)
      + metadata                        = (known after apply)
      + modify_index                    = (known after apply)
      + namespace_id                    = (known after apply)
      + parent_group_ids                = (known after apply)
      + policies                        = (known after apply)
      + type                            = (known after apply)
    }

  # module.gitlab.data.vault_identity_oidc_client_creds.creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_identity_oidc_client_creds" "creds" {
      + client_id     = (known after apply)
      + client_secret = (sensitive value)
      + id            = (known after apply)
      + name          = "gitlab"
    }

  # module.gitlab.vault_generic_secret.creds will be created
+ resource "vault_generic_secret" "creds" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + path                = "secret/oidc/gitlab"
    }

  # module.gitlab.vault_identity_oidc_assignment.app will be created
+ resource "vault_identity_oidc_assignment" "app" {
      + group_ids = (known after apply)
      + id        = (known after apply)
      + name      = "gitlab"
    }

  # module.gitlab.vault_identity_oidc_client.app will be created
+ resource "vault_identity_oidc_client" "app" {
      + access_token_ttl = 7200
      + assignments      = [
          + "gitlab",
        ]
      + client_id        = (known after apply)
      + client_secret    = (sensitive value)
      + client_type      = "confidential"
      + id               = (known after apply)
      + id_token_ttl     = 2400
      + key              = "kubefirst"
      + name             = "gitlab"
      + redirect_uris    = [
          + "https://gitlab.kubefirst.dev/users/auth/openid_connect/callback",
        ]
    }

Plan: 41 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/vault`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.kubefirst.dev/lock?id=abangser%252Fgitops%252Fterraform%252Fvault%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/vault`
</details>
Plan: 41 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`